ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_rtus.c
/*******************************************************************************
* Function Name: Cy_BLE_RTUSS_WriteEventHandler
****************************************************************************//**
*
*  Handles the Write Without Response Request Event for the Reference Time Update
*  Service.
*
*  \param cy_stc_ble_gatts_write_cmd_req_param_t * eventParam: The pointer to a data structure
*                                                  specified by the event.
*
*
*******************************************************************************/
static void Cy_BLE_RTUSS_WriteCmdEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    if(Cy_BLE_RTUS_ApplCallback != NULL)
    {
        /* Check if attribute handle is handle of Time Update Control Point
         * Characteristic of Reference Time Update Service. */
        if((cy_ble_rtusConfigPtr->rtuss->timeUpdateCpHandle == eventParam->handleValPair.attrHandle) &&
           (CY_BLE_RTUS_TIME_UPDATE_CP_SIZE == eventParam->handleValPair.value.len) &&
           (CY_BLE_RTUS_CANCEL_REF_UPDATE >= eventParam->handleValPair.value.val[0u]))
        {
            /* Input parameters validation passed, so save Time Update Control Point value */
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair = eventParam->handleValPair,
                .connHandle      = eventParam->connHandle,
                .offset          = 0u,
                .flags           = CY_BLE_GATT_DB_PEER_INITIATED
            };
            if(Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo) == CY_BLE_GATT_ERR_NONE)
            {
                cy_stc_ble_rtus_char_value_t wrCmdParam =
                {
                    .connHandle = eventParam->connHandle,
                    .charIndex  = CY_BLE_RTUS_TIME_UPDATE_CONTROL_POINT,
                    .value      = &eventParam->handleValPair.value
                };
                /* Send callback to user if no error occurred while writing Time Update Control
                 * Point.
                 */
                Cy_BLE_RTUS_ApplCallback((uint32_t)CY_BLE_EVT_RTUSS_WRITE_CHAR_CMD, (void*)&wrCmdParam);
                cy_ble_eventHandlerFlag &= (uint8_t)(~CY_BLE_CALLBACK);
            }
        }
        /* As this handler handles Write Without Response request the error response
         * can't be sent for the Client. The erroneous value will be with
         * CY_BLE_EVT_GATTS_WRITE_CMD_REQ event. User will decide how to handle it. */
    }
}


/*******************************************************************************
* Function Name: Cy_BLE_RTUSS_SetCharacteristicValue
****************************************************************************//**
*
*  Sets characteristic value of the Reference Time Update Service, which is
*  identified by charIndex in the local database.
*
*  \param charIndex:  The index of a service characteristic of
*                     type cy_en_ble_rtus_char_index_t.
*  \param attrSize:   The size of the characteristic value attribute.
*  \param attrValue: The pointer to the characteristic value
*                     data that should be stored to the GATT database.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - the request is handled successfully
*   * CY_BLE_ERROR_INVALID_PARAMETER - validation of the input parameters failed
*
*******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_RTUSS_SetCharacteristicValue(cy_en_ble_rtus_char_index_t charIndex,
                                                           uint8_t attrSize,
                                                           uint8_t *attrValue)
{
    cy_stc_ble_rtus_time_update_state_t tUState;
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
    {
        .handleValuePair.value.len = attrSize,
        .handleValuePair.value.val = attrValue,
        .offset                    = 0u,
        .flags                     = CY_BLE_GATT_DB_LOCALLY_INITIATED
    };

    if((CY_BLE_RTUS_CHAR_COUNT > charIndex))
    {
        if(charIndex == CY_BLE_RTUS_TIME_UPDATE_CONTROL_POINT)
        {
            dbAttrValInfo.handleValuePair.attrHandle = cy_ble_rtusConfigPtr->rtuss->timeUpdateCpHandle;

            if(*attrValue <= CY_BLE_RTUS_CANCEL_REF_UPDATE)
            {
                apiResult = CY_BLE_SUCCESS;
            }
        }
        else
        {
            dbAttrValInfo.handleValuePair.attrHandle = cy_ble_rtusConfigPtr->rtuss->timeUpdateStateHandle;

            tUState = *(cy_stc_ble_rtus_time_update_state_t*)attrValue;

            if((tUState.result <= CY_BLE_RTUS_RESULT_NO_UPDATE_ATTEMPT) &&
               (tUState.currentState <= CY_BLE_RTUS_CURR_STATE_UPDATE_PENDING))
            {
                apiResult = CY_BLE_SUCCESS;
            }
        }
        /* Store data in database */
        if(apiResult == CY_BLE_SUCCESS)
        {
            if(Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo) != CY_BLE_GATT_ERR_NONE)
            {
                apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
            }
        }
    }

    return(apiResult);
}


/*******************************************************************************
* Function Name: Cy_BLE_RTUSS_GetCharacteristicValue
****************************************************************************//**
*
*  Gets a characteristic value of the Reference Time Update Service, which
*  is identified by charIndex.
*
*  \param charIndex:  The index of a service characteristic of
*                     type cy_en_ble_rtus_char_index_t.
*
*  \param attrSize:   The size of the characteristic value attribute.
*
*  \param attrValue: The pointer to the location where
*                     characteristic value data should be stored.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - the request is handled successfully;
*   * CY_BLE_ERROR_INVALID_PARAMETER - validation of the input parameter failed.
*
*******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_RTUSS_GetCharacteristicValue(cy_en_ble_rtus_char_index_t charIndex,
                                                           uint8_t attrSize,
                                                           uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
    {
        .handleValuePair.value.len = attrSize,
        .handleValuePair.value.val = attrValue,
        .flags                     = CY_BLE_GATT_DB_LOCALLY_INITIATED
    };

